MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA2A2BD3CFM/mcu.h
    union
    {
        __IOM uint8_t VBTLVDSR;        /*!< (@ 0x000004C1) EXLVDVBAT Circuit Status Register                          */

        struct
        {
            uint8_t           : 1;
            __IOM uint8_t DET : 1;     /*!< [1..1] EXLVDVBAT Pin Low Voltage Detect Flag                              */
            uint8_t           : 3;
            __IM uint8_t MON  : 1;     /*!< [5..5] EXLVDVBAT Pin Low Voltage Monitor Flag                             */
            uint8_t           : 2;
        } VBTLVDSR_b;
    };

    union
    {
        __IOM uint8_t VBTCMPCR;        /*!< (@ 0x000004C2) EXLVDVBAT Comparator Control Register                      */

        struct
        {
            __IOM uint8_t CMPE : 1;    /*!< [0..0] EXLVDVBAT Pin Low Voltage Detect Circuit Output Enable             */
            uint8_t            : 7;
        } VBTCMPCR_b;
    };

    union
    {
        __IOM uint8_t VBTLVDICR;       /*!< (@ 0x000004C3) EXLVDVBAT Pin Low Voltage Detect Interrupt Control
                                        *                  Register                                                   */

        struct
        {
            __IOM uint8_t IE     : 1;  /*!< [0..0] EXLVDVBAT Pin Low Voltage Detect Interrupt Enable                  */
            uint8_t              : 3;
            __IOM uint8_t IDTSEL : 2;  /*!< [5..4] EXLVDVBAT Pin Low Voltage Detect Interrupt Generation
                                        *   Condition Select                                                          */
            uint8_t : 2;
        } VBTLVDICR_b;
    };

    union
    {
        __IOM uint8_t VRTLVDCR;        /*!< (@ 0x000004C4) LVDVRTC Circuit Control Register                           */

        struct
        {
            uint8_t            : 4;
            __IOM uint8_t LVDE : 1;    /*!< [4..4] VRTC Pin Low Voltage Detect Enable                                 */
            uint8_t            : 1;
            __IOM uint8_t LVL  : 2;    /*!< [7..6] VRTC Pin Low Voltage Detect Level Select                           */
        } VRTLVDCR_b;
    };

    union
    {
        __IOM uint8_t VRTSR;           /*!< (@ 0x000004C5) VRTC Status Register                                       */

        struct
        {
            __IOM uint8_t PORDET : 1;  /*!< [0..0] VRTC-domain Power-on Reset Detect Flag                             */
            __IOM uint8_t DET    : 1;  /*!< [1..1] VRTC Voltage Variation Detection Flag                              */
            uint8_t              : 2;
            __IM uint8_t VRTVLD  : 1;  /*!< [4..4] VRTC-domain Valid                                                  */
            __IM uint8_t MON     : 1;  /*!< [5..5] VRTC Signal Monitor Flag                                           */
            uint8_t              : 2;
        } VRTSR_b;
    };

    union
    {
        __IOM uint8_t VRTCMPCR;        /*!< (@ 0x000004C6) VRTC Comparator Control Register                           */

        struct
        {
            __IOM uint8_t CMPE : 1;    /*!< [0..0] VRTC Pin Low Voltage Detect Circuit Output Enable                  */
            uint8_t            : 7;
        } VRTCMPCR_b;
    };

    union
    {
        __IOM uint8_t VRTLVDICR;       /*!< (@ 0x000004C7) VRTC Pin Low Voltage Detect Interrupt Control
                                        *                  Register                                                   */

        struct
        {
            __IOM uint8_t IE     : 1;  /*!< [0..0] VRTC Pin Low Voltage Detect Interrupt Enable                       */
            uint8_t              : 3;
            __IOM uint8_t IDTSEL : 2;  /*!< [5..4] VRTC Pin Low Voltage Detect Interrupt Generation Condition
                                        *   Select                                                                    */
            uint8_t : 2;
        } VRTLVDICR_b;
    };

    union
    {
        __IOM uint8_t EXLVDCR;         /*!< (@ 0x000004C8) EXLVD Circuit Control Register                             */

        struct
        {
            uint8_t            : 4;
            __IOM uint8_t LVDE : 1;    /*!< [4..4] EXLVD Pin Low Voltage Detect Enable                                */
            uint8_t            : 3;
        } EXLVDCR_b;
    };

    union
    {
        __IOM uint8_t EXLVDSR;         /*!< (@ 0x000004C9) EXLVD Circuit Status Register                              */

        struct
        {
            uint8_t           : 1;
            __IOM uint8_t DET : 1;     /*!< [1..1] EXLVD pin Low Voltage Detect Flag                                  */
            uint8_t           : 3;
            __IM uint8_t MON  : 1;     /*!< [5..5] EXLVD pin Low Voltage Monitor Flag                                 */
            uint8_t           : 2;
        } EXLVDSR_b;
    };

    union
    {
        __IOM uint8_t EXLVDCMPCR;      /*!< (@ 0x000004CA) EXLVD Comparator Control Register                          */

        struct
        {
            __IOM uint8_t CMPE : 1;    /*!< [0..0] EXLVD Pin Low Voltage Detect Circuit Output Enable                 */
            uint8_t            : 7;
        } EXLVDCMPCR_b;
    };

    union
    {
        __IOM uint8_t EXLVDICR;        /*!< (@ 0x000004CB) EXLVD Pin Low Voltage Detect Interrupt Control
                                        *                  Register                                                   */

        struct
        {
            __IOM uint8_t IE     : 1;  /*!< [0..0] EXLVD Pin Low Voltage Detect Interrupt Enable                      */
            uint8_t              : 3;
            __IOM uint8_t IDTSEL : 2;  /*!< [5..4] EXLVD Pin Low Voltage Detect Interrupt Generation Condition
                                        *   Select                                                                    */
            uint8_t : 2;
        } EXLVDICR_b;
    };
    __IM uint32_t RESERVED61[13];

    union
    {
        __IOM uint8_t VBTBKR[512];     /*!< (@ 0x00000500) VBATT Backup Register [0..511]                             */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKR is a 512-byte readable/writable register to store
                                        *   data powered by VBATT.The value of this register is retained
                                        *   even when VCC is not powered but VBATT is powered.VBTBKR
                                        *   is initialized by VBATT selected voltage power-on-reset.                  */
        } VBTBKR_b[512];
    };
} R_SYSTEM_Type;                       /*!< Size = 1792 (0x700)                                                       */

/* =========================================================================================================================== */
/* ================                                          R_TRNG                                           ================ */
/* =========================================================================================================================== */

/**
 * @brief True Random Number Generator (R_TRNG)
 */

typedef struct                         /*!< (@ 0x400D1000) R_TRNG Structure                                           */
{
    union
    {
        __IM uint8_t TRNGSDR;          /*!< (@ 0x00000000) TRNG SEED Data Register                                    */

        struct
        {
            __IM uint8_t SDATA : 8;    /*!< [7..0] When RDRDY bit is 1, these bits hold the generated SEED.
                                        *   When RDRDY bit is 0, these bits are read as 00h.The SEED
                                        *   is generated as 32-bit data. When TRNGSDR is read 4 times
                                        *   while RDRDY = 1, SEED reading is completed and RDRDY bit
                                        *   changes to 0                                                              */
        } TRNGSDR_b;
    };
    __IM uint8_t RESERVED;

    union
    {
        __IOM uint8_t TRNGSCR0;        /*!< (@ 0x00000002) TRNG SEED Command Register 0                               */

        struct
        {
            uint8_t               : 2;
            __OM uint8_t  SGSTART : 1; /*!< [2..2] SEED Generation Start                                              */
            __IOM uint8_t SGCEN   : 1; /*!< [3..3] SEED Generation Circuit Enable                                     */
            uint8_t               : 3;
            __IM uint8_t RDRDY    : 1; /*!< [7..7] When SEED geenration is completed, this bit changes to
                                        *   0                                                                         */
        } TRNGSCR0_b;
    };

    union
    {
        __IOM uint8_t TRNGSCR1;        /*!< (@ 0x00000003) TRNG SEED Command Register 1                               */

        struct
        {
            __IOM uint8_t INTEN : 1;   /*!< [0..0] TRNG Interrupt Enable                                              */
            uint8_t             : 7;
        } TRNGSCR1_b;
    };
} R_TRNG_Type;                         /*!< Size = 4 (0x4)                                                            */

/* =========================================================================================================================== */
/* ================                                           R_TSN                                           ================ */
/* =========================================================================================================================== */

/**
 * @brief Temperature Sensor (R_TSN)
 */

