MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA2A2BD3CFM/mcu.h
typedef struct                         /*!< (@ 0x40044000) R_IRTC Structure                                           */
{
    union
    {
        __IM uint8_t R64CNT;           /*!< (@ 0x00000000) 64-Hz Counter                                              */

        struct
        {
            __IM uint8_t F64HZ : 1;    /*!< [0..0] 64Hz                                                               */
            __IM uint8_t F32HZ : 1;    /*!< [1..1] 32Hz                                                               */
            __IM uint8_t F16HZ : 1;    /*!< [2..2] 16Hz                                                               */
            __IM uint8_t F8HZ  : 1;    /*!< [3..3] 8Hz                                                                */
            __IM uint8_t F4HZ  : 1;    /*!< [4..4] 4Hz                                                                */
            __IM uint8_t F2HZ  : 1;    /*!< [5..5] 2Hz                                                                */
            __IM uint8_t F1HZ  : 1;    /*!< [6..6] 1Hz                                                                */
            uint8_t            : 1;
        } R64CNT_b;
    };
    __IM uint8_t RESERVED;

    union
    {
        union
        {
            __IOM uint8_t BCNT0_CNT;    /*!< (@ 0x00000002) Binary Counter 0 (binary count mode)                       */

            struct
            {
                __IOM uint8_t BCNT : 8; /*!< [7..0] The BCNT counter is a readable/writable 32-bit binary
                                         *   counter.                                                                  */
            } BCNT0_CNT_b;
        };

        union
        {
            __IOM uint8_t RSECCNT;       /*!< (@ 0x00000002) Second Counter (calendar count mode)                       */

            struct
            {
                __IOM uint8_t SEC1 : 4;  /*!< [3..0] 1-Second Count Counts from 0 to 9 every second. When
                                          *   a carry is generated, 1 is added to the tens place.                       */
                __IOM uint8_t SEC10 : 3; /*!< [6..4] 10-Second Count Counts from 0 to 5 for 60-second counting.         */
                uint8_t             : 1;
            } RSECCNT_b;
        };
    };
    __IM uint8_t RESERVED1;

    union
    {
        union
        {
            __IOM uint8_t BCNT1_CNT;    /*!< (@ 0x00000004) Binary Counter 1 (binary count mode)                       */

            struct
            {
                __IOM uint8_t BCNT : 8; /*!< [7..0] The BCNT counter is a readable/writable 32-bit binary
                                         *   counter.                                                                  */
            } BCNT1_CNT_b;
        };

        union
        {
            __IOM uint8_t RMINCNT;       /*!< (@ 0x00000004) Minute Counter (calendar count mode)                       */

            struct
            {
                __IOM uint8_t MIN1 : 4;  /*!< [3..0] 1-Minute Count Counts from 0 to 9 every minute. When
                                          *   a carry is generated, 1 is added to the tens place.                       */
                __IOM uint8_t MIN10 : 3; /*!< [6..4] 10-Minute Count Counts from 0 to 5 for 60-minute counting.         */
                uint8_t             : 1;
            } RMINCNT_b;
        };
    };
    __IM uint8_t RESERVED2;

    union
    {
        union
        {
            __IOM uint8_t BCNT2_CNT;    /*!< (@ 0x00000006) Binary Counter 2 (binary count mode)                       */

            struct
            {
                __IOM uint8_t BCNT : 8; /*!< [7..0] The BCNT counter is a readable/writable 32-bit binary
                                         *   counter.                                                                  */
            } BCNT2_CNT_b;
        };

        union
        {
            __IOM uint8_t RHRCNT;       /*!< (@ 0x00000006) Hour Counter (calendar count mode)                         */

            struct
            {
                __IOM uint8_t HR1 : 4;  /*!< [3..0] 1-Hour Count Counts from 0 to 9 once per hour. When a
                                         *   carry is generated, 1 is added to the tens place.                         */
                __IOM uint8_t HR10 : 2; /*!< [5..4] 10-Hour Count Counts from 0 to 2 once per carry from
                                         *   the ones place.                                                           */
                __IOM uint8_t PM : 1;   /*!< [6..6] Time Counter Setting for a.m./p.m.                                 */
                uint8_t          : 1;
            } RHRCNT_b;
        };
    };
    __IM uint8_t RESERVED3;

    union
    {
        union
        {
            __IOM uint8_t BCNT3_CNT;    /*!< (@ 0x00000008) Binary Counter 3 (binary count mode)                       */

            struct
            {
                __IOM uint8_t BCNT : 8; /*!< [7..0] The BCNT counter is a readable/writable 32-bit binary
                                         *   counter.                                                                  */
            } BCNT3_CNT_b;
        };

        union
        {
            __IOM uint8_t RWKCNT;       /*!< (@ 0x00000008) Day-of-Week Counter (calendar count mode)                  */

            struct
            {
                __IOM uint8_t DAYW : 3; /*!< [2..0] Day-of-Week Counting                                               */
                uint8_t            : 5;
            } RWKCNT_b;
        };
    };
    __IM uint8_t RESERVED4;

    union
    {
        __IOM uint8_t RDAYCNT;         /*!< (@ 0x0000000A) Day Counter (calendar count mode)                          */

        struct
        {
            __IOM uint8_t DATE1 : 4;   /*!< [3..0] 1-Day Count Counts from 0 to 9 once per day. When a carry
                                        *   is generated, 1 is added to the tens place.                               */
            __IOM uint8_t DATE10 : 2;  /*!< [5..4] 10-Day Count Counts from 0 to 3 once per carry from the
                                        *   ones place.                                                               */
            uint8_t : 2;
        } RDAYCNT_b;
    };
    __IM uint8_t RESERVED5;

    union
    {
        __IOM uint8_t RMONCNT;         /*!< (@ 0x0000000C) Month Counter (calendar count mode)                        */

        struct
        {
            __IOM uint8_t MON1 : 4;    /*!< [3..0] 1-Month Count Counts from 0 to 9 once per month. When
                                        *   a carry is generated, 1 is added to the tens place.                       */
            __IOM uint8_t MON10 : 1;   /*!< [4..4] 10-Month Count Counts from 0 to 1 once per carry from
                                        *   the ones place.                                                           */
            uint8_t : 3;
        } RMONCNT_b;
    };
    __IM uint8_t RESERVED6;

    union
    {
        __IOM uint16_t RYRCNT;         /*!< (@ 0x0000000E) Year Counter (calendar count mode)                         */

        struct
        {
            __IOM uint16_t YR1 : 4;    /*!< [3..0] 1-Year Count Counts from 0 to 9 once per year. When a
                                        *   carry is generated, 1 is added to the tens place.                         */
            __IOM uint16_t YR10 : 4;   /*!< [7..4] 10-Year Count Counts from 0 to 9 once per carry from
                                        *   ones place. When a carry is generated in the tens place,
                                        *   1 is added to the hundreds place.                                         */
            uint16_t : 8;
        } RYRCNT_b;
    };

    union
    {
        union
        {
            __IOM uint8_t BCNT0AR0;       /*!< (@ 0x00000010) Binary Counter 0 Alarm Register (binary count
                                           *                  mode)                                                      */

            struct
            {
                __IOM uint8_t BCNTAR : 8; /*!< [7..0] The BCNTAR counter is a readable/writable alarm register
                                           *   corresponding to 32-bit binary counter.                                   */
            } BCNT0AR0_b;
        };

        union
        {
            __IOM uint8_t RSECAR0;       /*!< (@ 0x00000010) Second Alarm Register (calendar count mode)                */

            struct
            {
                __OM uint8_t  SEC1  : 4; /*!< [3..0] 1-Second Value for the ones place of seconds                       */
                __IOM uint8_t SEC10 : 3; /*!< [6..4] 10-Seconds Value for the tens place of seconds                     */
                __IOM uint8_t ENB   : 1; /*!< [7..7] Compare enable                                                     */
            } RSECAR0_b;
        };
    };
    __IM uint8_t RESERVED7;

    union
    {
        union
        {
            __IOM uint8_t BCNT1AR0;       /*!< (@ 0x00000012) Binary Counter 1 Alarm Register (binary count
                                           *                  mode)                                                      */

            struct
            {
                __IOM uint8_t BCNTAR : 8; /*!< [7..0] The BCNTAR counter is a readable/writable alarm register
                                           *   corresponding to 32-bit binary counter.                                   */
            } BCNT1AR0_b;
        };

        union
        {
            __IOM uint8_t RMINAR0;       /*!< (@ 0x00000012) Minute Alarm Register (calendar count mode)                */

            struct
            {
                __IOM uint8_t MIN1  : 4; /*!< [3..0] 1-Minute Count Value for the ones place of minutes                 */
                __IOM uint8_t MIN10 : 3; /*!< [6..4] 10-Minute Count Value for the tens place of minutes                */
                __IOM uint8_t ENB   : 1; /*!< [7..7] Compare enable                                                     */
            } RMINAR0_b;
        };
    };
    __IM uint8_t RESERVED8;

    union
    {
        union
        {
            __IOM uint8_t BCNT2AR0;       /*!< (@ 0x00000014) Binary Counter 2 Alarm Register (binary count
                                           *                  mode)                                                      */

            struct
            {
                __IOM uint8_t BCNTAR : 8; /*!< [7..0] The BCNTAR counter is a readable/writable alarm register
                                           *   corresponding to 32-bit binary counter.                                   */
            } BCNT2AR0_b;
        };

        union
        {
            __IOM uint8_t RHRAR0;       /*!< (@ 0x00000014) Hour Alarm Register (calendar count mode)                  */

            struct
            {
                __IOM uint8_t HR1  : 4; /*!< [3..0] 1-Hour Count Value for the ones place of hours                     */
                __IOM uint8_t HR10 : 2; /*!< [5..4] 10-Hour Count Value for the tens place of hours                    */
                __IOM uint8_t PM   : 1; /*!< [6..6] Time Counter Setting for a.m./p.m.                                 */
                __IOM uint8_t ENB  : 1; /*!< [7..7] Compare enable                                                     */
            } RHRAR0_b;
        };
    };
    __IM uint8_t RESERVED9;

    union
    {
        union
        {
            __IOM uint8_t BCNT3AR0;       /*!< (@ 0x00000016) Binary Counter 3 Alarm Register (binary count
                                           *                  mode)                                                      */

            struct
            {
                __IOM uint8_t BCNTAR : 8; /*!< [7..0] The BCNTAR counter is a readable/writable alarm register
                                           *   corresponding to 32-bit binary counter.                                   */
            } BCNT3AR0_b;
        };

        union
        {
            __IOM uint8_t RWKAR0;       /*!< (@ 0x00000016) Day-of-Week Alarm Register (calendar count mode)           */

            struct
            {
                __IOM uint8_t DAYW : 3; /*!< [2..0] Day-of-Week Counting (calendar count mode)                         */
                uint8_t            : 4;
                __IOM uint8_t ENB  : 1; /*!< [7..7] Compare enable                                                     */
            } RWKAR0_b;
        };
    };
    __IM uint8_t RESERVED10;

    union
    {
        union
        {
            __IOM uint8_t BCNT0AER0;   /*!< (@ 0x00000018) Binary Counter 0 Alarm Enable Register (binary
                                        *                  count mode)                                                */

            struct
            {
                __IOM uint8_t ENB : 8; /*!< [7..0] The BCNT0AER register is a readable/writable register
                                        *   for setting the alarm enable corresponding to 32-bit binary
                                        *   counter.                                                                  */
            } BCNT0AER0_b;
        };

        union
        {
            __IOM uint8_t RDAYAR0;        /*!< (@ 0x00000018) Date Alarm Register (calendar count mode)                  */

            struct
            {
                __IOM uint8_t DATE1  : 4; /*!< [3..0] 1 Day Value for the ones place of days                             */
                __IOM uint8_t DATE10 : 2; /*!< [5..4] 10 Days Value for the tens place of days                           */
                uint8_t              : 1;
                __IOM uint8_t ENB    : 1; /*!< [7..7] Compare enable                                                     */
            } RDAYAR0_b;
        };
    };
    __IM uint8_t RESERVED11;

    union
    {
        union
        {
            __IOM uint8_t BCNT1AER0;   /*!< (@ 0x0000001A) Binary Counter 1 Alarm Enable Register (binary
                                        *                  count mode)                                                */

            struct
            {
                __IOM uint8_t ENB : 8; /*!< [7..0] The BCNT1AER register is a readable/writable register
                                        *   for setting the alarm enable corresponding to 32-bit binary
                                        *   counter.                                                                  */
            } BCNT1AER0_b;
        };

        union
        {
            __IOM uint8_t RMONAR0;       /*!< (@ 0x0000001A) Month Alarm Register (calendar count mode)                 */

            struct
            {
                __IOM uint8_t MON1  : 4; /*!< [3..0] 1 Month Value for the ones place of months                         */
                __IOM uint8_t MON10 : 1; /*!< [4..4] 10 Months Value for the tens place of months                       */
                uint8_t             : 2;
                __IOM uint8_t ENB   : 1; /*!< [7..7] Compare enable                                                     */
            } RMONAR0_b;
        };
    };
    __IM uint8_t RESERVED12;

    union
    {
        union
        {
            __IOM uint16_t BCNT2AER0;   /*!< (@ 0x0000001C) Binary Counter 2 Alarm Enable Register (binary
                                         *                  count mode)                                                */

            struct
            {
                __IOM uint16_t ENB : 8; /*!< [7..0] The BCNT2AER register is a readable/writable register
                                         *   for setting the alarm enable corresponding to 32-bit binary
                                         *   counter.                                                                  */
                uint16_t : 8;
            } BCNT2AER0_b;
        };

        union
        {
            __IOM uint16_t RYRAR0;       /*!< (@ 0x0000001C) Year Alarm Register (calendar count mode)                  */

            struct
            {
                __IOM uint16_t YR1  : 4; /*!< [3..0] 1 Year Value for the ones place of years                           */
                __IOM uint16_t YR10 : 4; /*!< [7..4] 10 Years Value for the tens place of years                         */
                uint16_t            : 8;
            } RYRAR0_b;
        };
    };

    union
    {
        union
        {
            __IOM uint8_t BCNT3AER0;   /*!< (@ 0x0000001E) Binary Counter 3 Alarm Enable Register (binary
                                        *                  count mode)                                                */

            struct
            {
                __IOM uint8_t ENB : 8; /*!< [7..0] The BCNT3AER register is a readable/writable register
                                        *   for setting the alarm enable corresponding to 32-bit binary
                                        *   counter b31 to b24.                                                       */
            } BCNT3AER0_b;
        };

        union
        {
            __IOM uint8_t RYRAREN0;    /*!< (@ 0x0000001E) Year Alarm Enable Register                                 */

            struct
            {
                uint8_t           : 7;
                __IOM uint8_t ENB : 1; /*!< [7..7] Compare enable                                                     */
            } RYRAREN0_b;
        };
    };
    __IM uint8_t  RESERVED13;
    __IM uint16_t RESERVED14;

    union
    {
        __IOM uint8_t RCR1;            /*!< (@ 0x00000022) RTC Control Register 1                                     */

        struct
        {
            __IOM uint8_t AIE   : 1;   /*!< [0..0] Alarm Interrupt Enable                                             */
            __IOM uint8_t CIE   : 1;   /*!< [1..1] Carry Interrupt Enable                                             */
            __IOM uint8_t PIE   : 1;   /*!< [2..2] Periodic Interrupt Enable                                          */
            __IOM uint8_t RTCOS : 1;   /*!< [3..3] RTCOUT Output Select                                               */
            __IOM uint8_t PES   : 4;   /*!< [7..4] Periodic Interrupt Select                                          */
        } RCR1_b;
    };
    __IM uint8_t RESERVED15;

    union
    {
        __IOM uint8_t RCR2;            /*!< (@ 0x00000024) RTC Control Register 2                                     */

        struct
        {
            __IOM uint8_t START : 1;   /*!< [0..0] Start                                                              */
            __IOM uint8_t RESET : 1;   /*!< [1..1] RTC Software Reset                                                 */
            __IOM uint8_t ADJ30 : 1;   /*!< [2..2] 30-Second Adjustment (only valid in calendar count mode)           */
            __IOM uint8_t RTCOE : 1;   /*!< [3..3] RTCOUT Output Enable                                               */
            __IOM uint8_t AADJE : 1;   /*!< [4..4] Automatic Adjustment Enable (When the LOCO clock is selected,
                                        *   the setting of this bit is disabled.)                                     */
            __IOM uint8_t AADJP : 1;   /*!< [5..5] Automatic Adjustment Period Select (When the LOCO clock
                                        *   is selected, the setting of this bit is disabled.)                        */
            __IOM uint8_t HR24  : 1;   /*!< [6..6] Hours Mode (only valid in calendar count mode)                     */
            __IOM uint8_t CNTMD : 1;   /*!< [7..7] Count Mode Select                                                  */
        } RCR2_b;
    };
    __IM uint8_t  RESERVED16;
    __IM uint16_t RESERVED17;

    union
    {
        __IOM uint8_t RCR4;            /*!< (@ 0x00000028) RTC Control Register 4                                     */

        struct
        {
            __IOM uint8_t ADJ500M : 1; /*!< [0..0] 0.5-second adjustment                                              */
            uint8_t               : 7;
        } RCR4_b;
    };
    __IM uint8_t  RESERVED18;
    __IM uint16_t RESERVED19[2];

    union
    {
        __IOM uint8_t RADJ;            /*!< (@ 0x0000002E) Time Error Adjustment Register                             */

        struct
        {
            __IOM uint8_t ADJ : 6;     /*!< [5..0] Adjustment Value These bits specify the adjustment value
                                        *   from the prescaler.                                                       */
            __IOM uint8_t PMADJ : 2;   /*!< [7..6] Plus-Minus                                                         */
        } RADJ_b;
    };
    __IM uint8_t RESERVED20;

    union
    {
        union
        {
            __IOM uint8_t BCNT0AR1;       /*!< (@ 0x00000030) Binary Counter 0 Alarm Register (binary count
                                           *                  mode)                                                      */

            struct
            {
                __IOM uint8_t BCNTAR : 8; /*!< [7..0] The BCNTAR counter is a readable/writable alarm register
                                           *   corresponding to 32-bit binary counter.                                   */
            } BCNT0AR1_b;
        };

        union
        {
            __IOM uint8_t RSECAR1;       /*!< (@ 0x00000030) Second Alarm Register (calendar count mode)                */

            struct
            {
                __OM uint8_t  SEC1  : 4; /*!< [3..0] 1-Second Value for the ones place of seconds                       */
                __IOM uint8_t SEC10 : 3; /*!< [6..4] 10-Seconds Value for the tens place of seconds                     */
                __IOM uint8_t ENB   : 1; /*!< [7..7] Compare enable                                                     */
            } RSECAR1_b;
        };
    };
    __IM uint8_t RESERVED21;

    union
    {
        union
        {
            __IOM uint8_t BCNT1AR1;       /*!< (@ 0x00000032) Binary Counter 1 Alarm Register (binary count
                                           *                  mode)                                                      */

            struct
            {
                __IOM uint8_t BCNTAR : 8; /*!< [7..0] The BCNTAR counter is a readable/writable alarm register
                                           *   corresponding to 32-bit binary counter.                                   */
            } BCNT1AR1_b;
        };

        union
        {
            __IOM uint8_t RMINAR1;       /*!< (@ 0x00000032) Minute Alarm Register (calendar count mode)                */

            struct
            {
                __IOM uint8_t MIN1  : 4; /*!< [3..0] 1-Minute Count Value for the ones place of minutes                 */
                __IOM uint8_t MIN10 : 3; /*!< [6..4] 10-Minute Count Value for the tens place of minutes                */
                __IOM uint8_t ENB   : 1; /*!< [7..7] Compare enable                                                     */
            } RMINAR1_b;
        };
    };
    __IM uint8_t RESERVED22;

    union
    {
        union
        {
            __IOM uint8_t BCNT2AR1;       /*!< (@ 0x00000034) Binary Counter 2 Alarm Register (binary count
                                           *                  mode)                                                      */

            struct
            {
                __IOM uint8_t BCNTAR : 8; /*!< [7..0] The BCNTAR counter is a readable/writable alarm register
                                           *   corresponding to 32-bit binary counter.                                   */
            } BCNT2AR1_b;
        };

