MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA2A2BD3CFM/mcu.h
        union
        {
            __IOM uint8_t RHRAR1;       /*!< (@ 0x00000034) Hour Alarm Register (calendar count mode)                  */

            struct
            {
                __IOM uint8_t HR1  : 4; /*!< [3..0] 1-Hour Count Value for the ones place of hours                     */
                __IOM uint8_t HR10 : 2; /*!< [5..4] 10-Hour Count Value for the tens place of hours                    */
                __IOM uint8_t PM   : 1; /*!< [6..6] Time Counter Setting for a.m./p.m.                                 */
                __IOM uint8_t ENB  : 1; /*!< [7..7] Compare enable                                                     */
            } RHRAR1_b;
        };
    };
    __IM uint8_t RESERVED23;

    union
    {
        union
        {
            __IOM uint8_t BCNT3AR1;       /*!< (@ 0x00000036) Binary Counter 3 Alarm Register (binary count
                                           *                  mode)                                                      */

            struct
            {
                __IOM uint8_t BCNTAR : 8; /*!< [7..0] The BCNTAR counter is a readable/writable alarm register
                                           *   corresponding to 32-bit binary counter.                                   */
            } BCNT3AR1_b;
        };

        union
        {
            __IOM uint8_t RWKAR1;       /*!< (@ 0x00000036) Day-of-Week Alarm Register (calendar count mode)           */

            struct
            {
                __IOM uint8_t DAYW : 3; /*!< [2..0] Day-of-Week Counting (calendar count mode)                         */
                uint8_t            : 4;
                __IOM uint8_t ENB  : 1; /*!< [7..7] Compare enable                                                     */
            } RWKAR1_b;
        };
    };
    __IM uint8_t RESERVED24;

    union
    {
        union
        {
            __IOM uint8_t BCNT0AER1;   /*!< (@ 0x00000038) Binary Counter 0 Alarm Enable Register (binary
                                        *                  count mode)                                                */

            struct
            {
                __IOM uint8_t ENB : 8; /*!< [7..0] The BCNT0AER register is a readable/writable register
                                        *   for setting the alarm enable corresponding to 32-bit binary
                                        *   counter.                                                                  */
            } BCNT0AER1_b;
        };

        union
        {
            __IOM uint8_t RDAYAR1;        /*!< (@ 0x00000038) Date Alarm Register (calendar count mode)                  */

            struct
            {
                __IOM uint8_t DATE1  : 4; /*!< [3..0] 1 Day Value for the ones place of days                             */
                __IOM uint8_t DATE10 : 2; /*!< [5..4] 10 Days Value for the tens place of days                           */
                uint8_t              : 1;
                __IOM uint8_t ENB    : 1; /*!< [7..7] Compare enable                                                     */
            } RDAYAR1_b;
        };
    };
    __IM uint8_t RESERVED25;

    union
    {
        union
        {
            __IOM uint8_t BCNT1AER1;   /*!< (@ 0x0000003A) Binary Counter 1 Alarm Enable Register (binary
                                        *                  count mode)                                                */

            struct
            {
                __IOM uint8_t ENB : 8; /*!< [7..0] The BCNT1AER register is a readable/writable register
                                        *   for setting the alarm enable corresponding to 32-bit binary
                                        *   counter.                                                                  */
            } BCNT1AER1_b;
        };

        union
        {
            __IOM uint8_t RMONAR1;       /*!< (@ 0x0000003A) Month Alarm Register (calendar count mode)                 */

            struct
            {
                __IOM uint8_t MON1  : 4; /*!< [3..0] 1 Month Value for the ones place of months                         */
                __IOM uint8_t MON10 : 1; /*!< [4..4] 10 Months Value for the tens place of months                       */
                uint8_t             : 2;
                __IOM uint8_t ENB   : 1; /*!< [7..7] Compare enable                                                     */
            } RMONAR1_b;
        };
    };
    __IM uint8_t RESERVED26;

    union
    {
        union
        {
            __IOM uint16_t BCNT2AER1_AR1; /*!< (@ 0x0000003C) Binary Counter 2 Alarm Enable Register (binary
                                           *                  count mode)                                                */

            struct
            {
                __IOM uint16_t ENB : 8;   /*!< [7..0] The BCNT2AER register is a readable/writable register
                                           *   for setting the alarm enable corresponding to 32-bit binary
                                           *   counter.                                                                  */
                uint16_t : 8;
            } BCNT2AER1_AR1_b;
        };

        union
        {
            __IOM uint16_t RYRAR1;       /*!< (@ 0x0000003C) Year Alarm Register (calendar count mode)                  */

            struct
            {
                __IOM uint16_t YR1  : 4; /*!< [3..0] 1 Year Value for the ones place of years                           */
                __IOM uint16_t YR10 : 4; /*!< [7..4] 10 Years Value for the tens place of years                         */
                uint16_t            : 8;
            } RYRAR1_b;
        };
    };

    union
    {
        union
        {
            __IOM uint8_t BCNT3AER1_AR1; /*!< (@ 0x0000003E) Binary Counter 3 Alarm Enable Register (binary
                                          *                  count mode)                                                */

            struct
            {
                __IOM uint8_t ENB : 8;   /*!< [7..0] The BCNT3AER register is a readable/writable register
                                          *   for setting the alarm enable corresponding to 32-bit binary
                                          *   counter b31 to b24.                                                       */
            } BCNT3AER1_AR1_b;
        };

        union
        {
            __IOM uint8_t RYRAREN1;    /*!< (@ 0x0000003E) Year Alarm Enable Register                                 */

            struct
            {
                uint8_t           : 7;
                __IOM uint8_t ENB : 1; /*!< [7..7] Compare enable                                                     */
            } RYRAREN1_b;
        };
    };
    __IM uint8_t            RESERVED27;
    __IOM R_IRTC_RTCCR_Type RTCCR[3];  /*!< (@ 0x00000040) Time Capture Control Register                              */
    __IM uint16_t           RESERVED28[6];
    __IOM R_IRTC_CP_Type    CP[3];     /*!< (@ 0x00000052) Capture registers                                          */
} R_IRTC_Type;                         /*!< Size = 130 (0x82)                                                         */

/* =========================================================================================================================== */
/* ================                                          R_MACL                                           ================ */
/* =========================================================================================================================== */

/**
 * @brief 32-bit Multiply-Accumulator (R_MACL)
 */

typedef struct                         /*!< (@ 0x400A0000) R_MACL Structure                                           */
{
    __IOM uint32_t         MULB0;      /*!< (@ 0x00000000) Multiplication Data Register Bn                            */
    __IM uint32_t          RESERVED;
    __IOM uint32_t         MULB1;      /*!< (@ 0x00000008) Multiplication Data Register Bn                            */
    __IM uint32_t          RESERVED1;
    __IOM uint32_t         MULB2;      /*!< (@ 0x00000010) Multiplication Data Register Bn                            */
    __IM uint32_t          RESERVED2;
    __IOM uint32_t         MULB3;      /*!< (@ 0x00000018) Multiplication Data Register Bn                            */
    __IM uint32_t          RESERVED3;
    __IOM uint32_t         MULB4;      /*!< (@ 0x00000020) Multiplication Data Register Bn                            */
    __IM uint32_t          RESERVED4;
    __IOM uint32_t         MULB5;      /*!< (@ 0x00000028) Multiplication Data Register Bn                            */
    __IM uint32_t          RESERVED5;
    __IOM uint32_t         MULB6;      /*!< (@ 0x00000030) Multiplication Data Register Bn                            */
    __IM uint32_t          RESERVED6;
    __IOM uint32_t         MULB7;      /*!< (@ 0x00000038) Multiplication Data Register Bn                            */
    __IM uint32_t          RESERVED7;
    __IOM uint32_t         MULB8;      /*!< (@ 0x00000040) Multiplication Data Register Bn                            */
    __IM uint32_t          RESERVED8;
    __IOM uint32_t         MULB9;      /*!< (@ 0x00000048) Multiplication Data Register Bn                            */
    __IM uint32_t          RESERVED9;
    __IOM uint32_t         MULB10;     /*!< (@ 0x00000050) Multiplication Data Register Bn                            */
    __IM uint32_t          RESERVED10;
    __IOM uint32_t         MULB11;     /*!< (@ 0x00000058) Multiplication Data Register Bn                            */
    __IM uint32_t          RESERVED11;
    __IOM uint32_t         MULB12;     /*!< (@ 0x00000060) Multiplication Data Register Bn                            */
    __IM uint32_t          RESERVED12;
    __IOM uint32_t         MULB13;     /*!< (@ 0x00000068) Multiplication Data Register Bn                            */
    __IM uint32_t          RESERVED13;
    __IOM uint32_t         MULB14;     /*!< (@ 0x00000070) Multiplication Data Register Bn                            */
    __IM uint32_t          RESERVED14;
    __IOM uint32_t         MULB15;     /*!< (@ 0x00000078) Multiplication Data Register Bn                            */
    __IM uint32_t          RESERVED15;
    __IOM uint32_t         MULB16;     /*!< (@ 0x00000080) Multiplication Data Register Bn                            */
    __IM uint32_t          RESERVED16;
    __IOM uint32_t         MULB17;     /*!< (@ 0x00000088) Multiplication Data Register Bn                            */
    __IM uint32_t          RESERVED17;
    __IOM uint32_t         MULB18;     /*!< (@ 0x00000090) Multiplication Data Register Bn                            */
    __IM uint32_t          RESERVED18;
    __IOM uint32_t         MULB19;     /*!< (@ 0x00000098) Multiplication Data Register Bn                            */
    __IM uint32_t          RESERVED19;
    __IOM uint32_t         MULB20;     /*!< (@ 0x000000A0) Multiplication Data Register Bn                            */
    __IM uint32_t          RESERVED20;
    __IOM uint32_t         MULB21;     /*!< (@ 0x000000A8) Multiplication Data Register Bn                            */
    __IM uint32_t          RESERVED21;
    __IOM uint32_t         MULB22;     /*!< (@ 0x000000B0) Multiplication Data Register Bn                            */
    __IM uint32_t          RESERVED22;
    __IOM uint32_t         MULB23;     /*!< (@ 0x000000B8) Multiplication Data Register Bn                            */
    __IM uint32_t          RESERVED23;
    __IOM R_MACL_MULR_Type MULR0;      /*!< (@ 0x000000C0) Multiplication Result Register n                           */
    __IOM R_MACL_MULR_Type MULR1;      /*!< (@ 0x000000C8) Multiplication Result Register n                           */
    __IOM R_MACL_MULR_Type MULR2;      /*!< (@ 0x000000D0) Multiplication Result Register n                           */
    __IOM R_MACL_MULR_Type MULR3;      /*!< (@ 0x000000D8) Multiplication Result Register n                           */
    __IOM R_MACL_MULR_Type MULR4;      /*!< (@ 0x000000E0) Multiplication Result Register n                           */
    __IOM R_MACL_MULR_Type MULR5;      /*!< (@ 0x000000E8) Multiplication Result Register n                           */
    __IOM R_MACL_MULR_Type MULR6;      /*!< (@ 0x000000F0) Multiplication Result Register n                           */
    __IOM R_MACL_MULR_Type MULR7;      /*!< (@ 0x000000F8) Multiplication Result Register n                           */
    __IOM R_MACL_MULR_Type MULR8;      /*!< (@ 0x00000100) Multiplication Result Register n                           */
    __IOM R_MACL_MULR_Type MULR9;      /*!< (@ 0x00000108) Multiplication Result Register n                           */
    __IOM R_MACL_MULR_Type MULR10;     /*!< (@ 0x00000110) Multiplication Result Register n                           */
    __IOM R_MACL_MULR_Type MULR11;     /*!< (@ 0x00000118) Multiplication Result Register n                           */
    __IOM R_MACL_MULR_Type MULR12;     /*!< (@ 0x00000120) Multiplication Result Register n                           */
    __IOM R_MACL_MULR_Type MULR13;     /*!< (@ 0x00000128) Multiplication Result Register n                           */
    __IOM R_MACL_MULR_Type MULR14;     /*!< (@ 0x00000130) Multiplication Result Register n                           */
    __IOM R_MACL_MULR_Type MULR15;     /*!< (@ 0x00000138) Multiplication Result Register n                           */
    __IOM R_MACL_MULR_Type MULR16;     /*!< (@ 0x00000140) Multiplication Result Register n                           */
    __IOM R_MACL_MULR_Type MULR17;     /*!< (@ 0x00000148) Multiplication Result Register n                           */
    __IOM R_MACL_MULR_Type MULR18;     /*!< (@ 0x00000150) Multiplication Result Register n                           */
    __IOM R_MACL_MULR_Type MULR19;     /*!< (@ 0x00000158) Multiplication Result Register n                           */
    __IOM R_MACL_MULR_Type MULR20;     /*!< (@ 0x00000160) Multiplication Result Register n                           */
    __IOM R_MACL_MULR_Type MULR21;     /*!< (@ 0x00000168) Multiplication Result Register n                           */
    __IOM R_MACL_MULR_Type MULR22;     /*!< (@ 0x00000170) Multiplication Result Register n                           */
    __IOM R_MACL_MULR_Type MULR23;     /*!< (@ 0x00000178) Multiplication Result Register n                           */
    __IOM uint32_t         MUL32U;     /*!< (@ 0x00000180) Multiplication Data Register A                             */
    __IOM uint32_t         MUL32S;     /*!< (@ 0x00000184) Multiplication Data Register A                             */
    __IOM uint32_t         MAC32U;     /*!< (@ 0x00000188) Multiplication-Accumulation Data Register A                */
    __IOM uint32_t         MAC32S;     /*!< (@ 0x0000018C) Multiplication-Accumulation Data Register A                */

    union
    {
        __IOM uint8_t MULC;            /*!< (@ 0x00000190) Multiplication Control Register                            */

        struct
        {
            __IM uint8_t MULST : 1;    /*!< [0..0] Operation Processing Status Bit                                    */
            __IM uint8_t MACSF : 1;    /*!< [1..1] Multiply-accumulation Result (accumulation value) Sign
                                        *   Flag                                                                      */
            __IM uint8_t MACOF : 1;    /*!< [2..2] Multiply-accumulation Result (accumulation value) Overflow/Underflow
                                        *   Flag                                                                      */
            uint8_t               : 1;
            __IOM uint8_t MULFRAC : 1; /*!< [4..4] Fixed Point Mode Selection R                                       */
            uint8_t               : 1;
            __IOM uint8_t MULSM   : 1; /*!< [6..6] Signedness Selection                                               */
            __IOM uint8_t MACMODE : 1; /*!< [7..7] Operation Mode Selection                                           */
        } MULC_b;
    };
    __IM uint8_t   RESERVED24;
    __IM uint16_t  RESERVED25;
    __IOM uint32_t MULRCLR;            /*!< (@ 0x00000194) Multiplication Result Clear Register                       */
} R_MACL_Type;                         /*!< Size = 408 (0x198)                                                        */

/* =========================================================================================================================== */
/* ================                                         R_SDADC_B                                         ================ */
/* =========================================================================================================================== */

/**
 * @brief 24-bit Sigma-Delta ADC (R_SDADC_B)
 */

typedef struct                         /*!< (@ 0x4009C000) R_SDADC_B Structure                                        */
{
    union
    {
        __IOM uint8_t SDADCCR;         /*!< (@ 0x00000000) Sigma-Delta A/D Clock Control Register                     */

        struct
        {
            __IOM uint8_t CK : 2;      /*!< [1..0] Operating clock of the digital block                               */
            uint8_t          : 6;
        } SDADCCR_b;
    };
    __IM uint8_t  RESERVED;
    __IM uint16_t RESERVED1;

    union
    {
        __IOM uint32_t SDADMR;         /*!< (@ 0x00000004) Operating clock of the digital block                       */

        struct
        {
            __IOM uint32_t CE0 : 1;    /*!< [0..0] Sigma-Delta A/D converter operation enable for channel
                                        *   n                                                                         */
            __IOM uint32_t CE1 : 1;    /*!< [1..1] Sigma-Delta A/D converter operation enable for channel
                                        *   n                                                                         */
            __IOM uint32_t CE2 : 1;    /*!< [2..2] Sigma-Delta A/D converter operation enable for channel
                                        *   n                                                                         */
            __IOM uint32_t CE3 : 1;    /*!< [3..3] Sigma-Delta A/D converter operation enable for channel
                                        *   n                                                                         */
            __IOM uint32_t CE4 : 1;    /*!< [4..4] Sigma-Delta A/D converter operation enable for channel
                                        *   n                                                                         */
            __IOM uint32_t CE5 : 1;    /*!< [5..5] Sigma-Delta A/D converter operation enable for channel
                                        *   n                                                                         */
            __IOM uint32_t CE6 : 1;    /*!< [6..6] Sigma-Delta A/D converter operation enable for channel
                                        *   n                                                                         */
            uint32_t            : 9;
            __IOM uint32_t PON0 : 1;   /*!< [16..16] Sigma-Delta A/D converter power-on control for channel
                                        *   n                                                                         */
            __IOM uint32_t PON1 : 1;   /*!< [17..17] Sigma-Delta A/D converter power-on control for channel
                                        *   n                                                                         */
            __IOM uint32_t PON2 : 1;   /*!< [18..18] Sigma-Delta A/D converter power-on control for channel
                                        *   n                                                                         */
            __IOM uint32_t PON3 : 1;   /*!< [19..19] Sigma-Delta A/D converter power-on control for channel
                                        *   n                                                                         */
            __IOM uint32_t PON4 : 1;   /*!< [20..20] Sigma-Delta A/D converter power-on control for channel
                                        *   n                                                                         */
            __IOM uint32_t PON5 : 1;   /*!< [21..21] Sigma-Delta A/D converter power-on control for channel
                                        *   n                                                                         */
            __IOM uint32_t PON6 : 1;   /*!< [22..22] Sigma-Delta A/D converter power-on control for channel
                                        *   n                                                                         */
            uint32_t           : 5;
            __IOM uint32_t FR  : 2;    /*!< [29..28] Sampling mode select                                             */
            __IOM uint32_t TYP : 1;    /*!< [30..30] Resolution of A/D conversion result reading                      */
            uint32_t           : 1;
        } SDADMR_b;
    };
    __IM uint32_t RESERVED2;

    union
    {
        __IOM uint8_t SDADRR;          /*!< (@ 0x0000000C) Sigma-Delta A/D Reset Register                             */

        struct
        {
            __IOM uint8_t RES : 1;     /*!< [0..0] Sigma-Delta A/D converter reset                                    */
            uint8_t           : 7;
        } SDADRR_b;
    };
    __IM uint8_t  RESERVED3;
    __IM uint16_t RESERVED4;

    union
    {
        __IOM uint32_t SDADGCR;        /*!< (@ 0x00000010) Sigma-Delta A/D Gain Control Register                      */

        struct
        {
            __IOM uint32_t GAIN0 : 3;  /*!< [2..0] Preamplifier gain for channel n                                    */
            uint32_t             : 1;
            __IOM uint32_t GAIN1 : 3;  /*!< [6..4] Preamplifier gain for channel n                                    */
            uint32_t             : 1;
            __IOM uint32_t GAIN2 : 3;  /*!< [10..8] Preamplifier gain for channel n                                   */
            uint32_t             : 1;
            __IOM uint32_t GAIN3 : 3;  /*!< [14..12] Preamplifier gain for channel n                                  */
            uint32_t             : 1;
            __IOM uint32_t GAIN4 : 3;  /*!< [18..16] Preamplifier gain for channel n                                  */
            uint32_t             : 1;
            __IOM uint32_t GAIN5 : 3;  /*!< [22..20] Preamplifier gain for channel n                                  */
            uint32_t             : 1;
            __IOM uint32_t GAIN6 : 3;  /*!< [26..24] Preamplifier gain for channel n                                  */
            uint32_t             : 5;
        } SDADGCR_b;
    };
    __IM uint32_t RESERVED5;

    union
    {
        __IOM uint32_t SDADHPFCR;      /*!< (@ 0x00000018) Sigma-Delta A/D HPF Control Register                       */

